f = open('26.3.txt')
n = int(f.readline())
tovari = [] # товары
tovari120 = [] # товары дороже 120
for s in f:
    tovari.append(int(s))
    if int(s) > 120:
        tovari120.append(int(s))
tovari120.sort()
skidka = sum(tovari120[:len(tovari120)//2])*0.25 # размер скидки
print(sum(tovari) - skidka) # сколько заплатил покупатель
print(max(tovari120[:len(tovari120)//2])) # самый большой товар на который действует скидка

# открываем файл, певрое число записываем в n, создаём пустой список товаров и товаров, стоящих больше 120 (на них действует скидка)
# записываем каждый элемент из файла в список товаров и, если этот элемент больше 120 записываем ещё и в список товаров со скидкой (tovari120)
# сортируем список товаров по скидке от самого маленького к самому большому, так как магазин сам распределяет расположение товаров и со скидкой оказываются
# самые дешёвые товары (они в терминале магазина засчитываются как вторые в списке пробитых товаров)
# высчитываем сумму половины элементов в tovari120, потому что каждый второй элемент, стоящий больше 120, будет иметь скидку, и умножаем на 0.25 потому что скидка 25% (skidka)
# выводим сумму всех элементов списка товары и вычитаем из неё скидку, получим чколько всего заплатил покупатель
# выводим максимальный элемент из половины списка товары 120.
# !!!!!!!!!!!!!!!!!!!! ВАЖНО ОКРУГЛИТЬ ДО ЦЕЛОГО ЧИСЛА ВВЕРХ ЭТО В УСЛОВИИ ЗАДАЧИ ПРОПИСАНО ДУРА НЕ ЗАБУДЬ!!!!!!!!!!!!!!!!!!!!