f = open('26.4.txt')
n = int(f.readline())
tovari = []
for s in f:
    tovari.append(int(s))
tovari.sort(reverse=True) # элементы начиная с дорогого
skidka = sum(tovari[:n//4])*0.5 #скидка на первую четверть(самые дорогие товары), как и хотел покупатель.
print(sum(tovari) - skidka) #сколько покупатеь ХОТЕЛ заплатить
tovari.sort() # элементы начиная с дешёвого
skidka = sum(tovari[:n//4])*0.5 #скидка на первую четверть(самые дешёвые товары), как получилось на кассе.
print(sum(tovari) - skidka) # сколько покупатель в итоге заплатил

# запизиваем каждую цифру из файла кроме первой в список товары, сортируем список от большего к меньшему
# высчитываем скидку, и высчитываем сумму которую хотел заплатить покупатель
# То же самое но с списком отсортированным от меньшего к большему