f = open('26.5.txt')
n = int(f.readline())
tovari = []
for s in f:
    tovari.append(int(s))
tovari.sort(reverse=True)
print(sum(tovari) - sum(tovari[:n//3])) # забираем из общей стоимости самую дорогую треть, как хотел покупатель
summ = sum(tovari)
for i in range(2, len(tovari), 3): # начиная с третьего элемента (первый элемент имеет индекс 0), до конца списка
    # с шагом 3
    summ -= tovari[i]
print(summ) # сколько покупатель заплатил, с учётом распределения товаров в группы по три с максимально выгодным
# расположением (в одной тройке самые дорогие товары, третий товар бесплатно), так скидка для покупателя получается
# больше, а значит выгоднее