f = open('26дз.txt')
N = int(f.readline()) # пассажиры которые хотят сдать багаж
K = int(f.readline()) # свободные ячейки
data = [list(map(int, i.split())) for i in f] #split() разбивает по пробелам, map присеняет Int к каждому переданному значению.
# сюда кароч записывается время сдачи багажа а потом время его выдачи
data.sort()
chranilishe = [0]*K  #хранилище, тоесть сколько свобожных ячеек, изначально время 0 потому что в ячейке с самого начала нет багажа
count = last = 0 #количество и последняя ячейка
for i in range(N): # для каждого пассажриа анализируем скаждую ячейку
    for j in range(len(chranilishe)):
        if data[i][0] > chranilishe[j]: #data[i][0] означает что берём первый элемент(время сдачи багажа), потом сравниваем с
# с временем получения предыдущего багажа, чтобы понять свободна ли ячейка. тоесть если время сдачи багажа 10 а время выдачи предыдущего багажа
# 60 то багаж в ячейку не поместится и надо запихнуть его в следующую
            count+=1
            chranilishe[j] = data[i][1] # записываем, что в ячейке j лежит багаж, время сдачи воторого равняется второму числу в data
            last = j + 1
            break
print(count, last)

# В аэропорту есть камера хранения из K ячеек, которые пронумерованы с 1. Принимаемый багаж кладется в свободную
# ячейку с минимальным номером. Известно время, когда пассажиры сдают и забирают багаж (в минутах с начала суток).
# Ячейка доступна для багажа, начиная со следующей минуты, после окончания срока хранения. Если свободных ячеек
# не находится, то багаж не принимается в камеру хранения.
# Найдите количество багажа, которое будет сдано в камеры за 24 часа и номер ячейки, в которую сдаст багаж последний пассажир.
# Входные данные:
# В первой строке входного файла находится число K – количество ячеек в камере хранения,
# во второй строке файла число N – количество пассажиров, сдающих багаж (натуральное число, не превышающее 1000).
# Каждая из следующих N строк содержит два натуральных числа, не превышающих 1440: время сдачи багажа и время выдачи багажа.
# Выходные данные:
# Программа должна вывести два числа: количество сданных в камеру хранения багажа и номер ячейки,
# в которую примут багаж у последнего пассажира, который сможет сдать багаж.
# Типовой пример организации данных:
# 2
# 5
# 30 60
# 40 60
# 50 1110
# 61 1010
# 1100 1440
# Для указанного примера багаж смогут сдать первый, второй, четвёртый и пятый пассажир.
# Последний пассажир сдаст свой багаж в ячейку один, так как к этому моменту первая и вторая ячейка будут свободны.